<?php slot('title') ?>
  DC++: настройка, использование - Coocoorooza
<?php end_slot(); ?>

<div id="entrance">
  <h1>DC++: настройка, использование</h1>
<p>Начнем с того что скачаем последнюю версию DC ++
<a target="_blank" href="http://dcplusplus.sourceforge.net/index.php?page=download">
отсюда</a>&nbsp; и
<a target="_blank" href="http://sourceforge.net/tracker/?atid=460289&group_id=40287&func=browse">

перевод</a></p>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.25.gif" width="687" height="474"></p>
<p>Так должен выглядеть DC ++ после первого запуска<br>
А теперь приступим к настройке нашего DC ++ </p>
<h2>General</h2>

<p>Теперь открываем <b>File &gt; Settings</b> ,появляется окно настроек</p>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.251.gif" width="439" height="461"></p>
<p>В поле <b>&quot;Nick&quot;</b> вводим свой ник-нейм (обязательный параметр)<br>

Далее в поле <b>&quot;E-Mail&quot;</b> вводим ваш e-mail адрес<br>
В поле <b>&quot;Description&quot;</b> желательно ввести тип информации, которую 
предполагаем отдать в пользование<br>
Выбираем свой <b>&quot;Connection&quot;</b> - тип связи с интернет-провайдером 
(не обязательный параметр)</p>

<h2><br>
<b>Connection Settings</b></h2>
<p><br>
<b>&quot;Active&quot;</b> если у вас нет FireWall оставляйте без изменений,в 
окне &quot;port&quot; можно указать номер порта с которым будет работать DC 
++<br>
<b>&quot;Passive&quot;</b> если вы работаете с FireWall обязательно отметте
<b>&quot;Passive&quot; </b>т.к. FireWall блокирует поиск. Пользователи в &quot;Passive 
Mode&quot; не могут соединяться с другими пользователями, кто находятся 
в &quot;Passive Mode&quot;.<br>

<b>&quot;SOCKS 5&quot;</b> это для тех кто работает через proxy</p>
<h2><b>Downloads</b></h2>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.306.gif" width="439" height="461"></p>
<p>Нажав на кнопку <b>&quot;Browse&quot; </b>в окне <b>Default downloads directory</b>, 
указываем, куда скачивать готовые файлы<br>

Нажав на кнопку <b>&quot;Browse&quot; </b>в окне <b>Unfinished downloads directory</b>, 
указываем, куда скачивать недокачаные файлы (после окончания закачки 
файлы с Unfinished downloads directory автоматически перемещаются 
в Default downloads directory)<br>
<br>
Раздел - <b>&quot;Options&quot;</b>. В нем вы можете указать количество ваших 
скачиваний в один момент времени если оставить &quot;0&quot;, то нет ограничений, 
вы, также, можете указать минимальную скорость скачивания, например, 
если скорость меньше &quot;10kB/s&quot; не скачивать ну и понятно, что значение 
ноль снимает данное ограничение</p>

<h2><b>Sharing</b></h2>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.305.gif" width="439" height="461"></p>
<p>Кнопкой <b>&quot;Add folder&quot;</b> можно добавить папку в шеринг, а 
кнопкой <b>&quot;Remove&quot;</b> мы удаляем папку из шеринга.<br>

Возможно, в папках находятся файлы с атрибутом <b>&quot;hidden&quot;</b>, 
если поставить галочку <b>&quot;Share hidden files&quot;</b> то они тоже будут 
отданы в шеринг.<br>
Опция <b>&quot;Atomatically open...&quot;</b> позволяет автоматически добавлять 
дополнительный слот<br>
Вы также, можете указать количество <b>&quot;Uploads slots&quot;</b>. Если 
3 &quot;слота&quot; открытые, тогда 3-e людей могут загружать данные.Cообщение
<b>&quot;No free slots&quot;</b> говорит о том, что Вы в очереди и начнете 
разгружать файл, как только появиться место.</p>

<h2><b>Appearance</b></h2>
<p><img border="0" src="/images/static_page/p2p/dc_v0.304.gif"></p>
<p>В разделе <b>&quot;Colors&quot;</b> можно задать цвет фона, а также, цвет 
и размер шрифта.</p>
<p>Так может выглядеть DC ++ после настроек цвета</p>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.301.gif" width="687" height="474"></p>

<p>И в разделе <b>&quot;Language file&quot;</b> можно подключить языковой 
модуль.<br>
<b>&quot;Minimize to tray&quot;</b> - сворачивать в трей<br>
<b>&quot;Automatically enable timestamps in chat windows&quot;</b> - автоматически 
проставляет время каждого сообщения.<br>
<b>&quot;Show joins/parts in main chat&quot;</b> - показывает входящих и выходящих 
в основном окне.<br>

<b>&quot;Use sistem icons when browsing files&quot;</b> - использовать системные 
иконки при просмотре файлов.<br>
<b>&quot;Confirm application exit&quot;</b> - спрашивает при закрытии DC ++ 
: вы действительно хотите закрыть программу ?</p>
<h2><b>Logs and Sounds</b></h2>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.263.gif" width="439" height="461"></p>

<p><b>&quot;Logging&quot; </b>- опция позволяет записывать логи главного чата,приват 
чата,downloads.uploads.<br>
<b>&quot;Sounds&quot;</b> - опция позволяет проиграть звуковой файл при получении 
приват сообщения</p>
<h2><b>Advanced</b></h2>
<p>
<img border="0" src="/images/static_page/p2p/dc_v0.261.gif" width="439" height="461"></p>

<p><b>&quot;Rollback&quot;</b> - опция позволяет избежать порчи файлов при 
смене пользователей, убирая указанное количество данных каждый раз 
Вы возобновляете разгрузку.<br>
<b>&quot;Write Size Buffer&quot; </b>- я точно не знаю.Что то связано с фрагментацией.<br>
<b>&quot;Clear search box after each search&quot;</b> - очищает строку поиска 
после каждого поиска.<br>
<b>&quot;Automatically search for alternative download location&quot;</b> 
- автоматически ищет другого человека,чтобы скачать ваш файл,если 
то человек у которого вы качали off-line.<br>

<b>&quot;Open the download queue window at starpup&quot;</b> - открывает окошко 
с файлами, которые вы качаете или которые ожидают своей очереди 
на закачку.<br>
<b>&quot;Automatically follow redirects&quot;</b> - автоматически следует 
переадресации (если хаб полный и т.д.)<br>
<b>&quot;Enable SFV checking&quot;</b> - Много загрузок в DC содержат sfv 
файл, чтобы проверить целостность загрузки. DC может непрерывно 
вычислять значения CRC 32 для<br>
файла и сравнивает с sfv файлом. Если проверка терпит неудачу,<br>

файл автоматически загружен еще раз от того же самого пользователя<br>
и если это терпит неудачу, пользователь удален как источник. Для 
этого, чтобы работать,sfv файл должен быть в том же самом целевом 
каталоге, поскольку загрузка идет.</p>
<p>При работе с DC++ вы видите странные значки в скобках возле ников, 
расшифровываю</p>
<p>
<img border="0" src="/images/static_page/p2p/dc_stealth.gif" width="415" height="99"></p>
<p>&lt;++ V:x,M:x,H:x/y/z,S:x[,O:x]&gt;<br>
<br>

<b>V</b> - версия используемой программы <br>
<b>M </b>- статус пользователя, А - актив, Р - пассив (за firewall)
<br>
<b>H </b>- количество хабов на которых находится пользователь
<br>
<b>&nbsp; x</b> - количество хабов на которых вы не зарегистрированый 
пользователь <br>

<b>&nbsp; y</b> - количество хабов на которых вы зарегистрированый 
пользователь<br>
<b>&nbsp; z </b>- количество хабов на которых вы оператор хаба
<br>
<b>S</b> - количество слотов для скачивания.<br>
<b>O</b> - если общий upload - ниже этого значения DC , откроет 
другой слот <br>

Если возле ника вы видите ключ, это значит человек - админ или оператор 
на хабе. Если возле ника кирпичики, значит человек за firewall</p>
<p><b>И еще несколько интересных возможностей</b> :<br>
<br>
<b>1.</b> Вы можете посмотреть что ищут другие люди. Для этого вам 
надо зайти в - <b>File , search spy</b>.Увидев там что-то хорошее,смело 
жмите правую кнопку мыши и <b>search</b>.<br>

<b>2.</b> Что бы каждый раз при старте DC++ не писать адреса для 
коннекта, делайте следующее : <b>File , Favorite hubs</b> (Ctrl+F). 
Тут указывайте название хаба и его IP , а рядом с ним ставьте галочку.<br>
<b>3.</b> Вы можете смело выключать DC++, даже если файл полностью 
не скачен. При новом запуске програмка продолжит скачивание с того 
же самого места, при условии, что файл не удалялся и не перемещался 
в другую дирректорию. <br>
Есть так же встроенные в DC команды которыми вы можете пользоваться 
на любом хабе независимо от установленных скриптов на хабе<br>
<br>

<b>/join &lt;hub&gt;</b>...............присоединение к хабу <br>
<b>/ts</b>.............................проставляет время каждого 
сообщения, повторная команда отключает показ времени <br>
<b>/showjoins</b>................показывает пришедших и уходящих 
в основном окне, повторная команда отключает показ <br>
<b>/search (x)</b>...............поиск x <br>

<b>/clear</b>.......................очищает основное окно <br>
<b>/away (message)</b>....отправляет сообщение в авто-ответ <br>
<b>/back</b>.......................выключает команду /away <br>
<b>/slots (x)</b>..................изменяет количество слотов на 
x<br>
<b>/grant</b>.....................открытие grants a slot пользователю 
с которым вы приват чате <br>

<b>/close</b>......................закрытие активного окна <br>
<b>/refresh</b>..................обновление общих файлов <br>
<b>/help</b>.......................встроенные в DC команды <br>
<b>/dc++</b>.....................информация о DC и ссылка где можно 
скачать DC <br>
<b>/fav /favorite</b>.........добавляет активный хаб в &quot;избраное&quot;

</p>
<p><br>
Наверное этой информации должно хватить для начала, дальше разберетесь 
сами, и еще... щелкайте правой кнопкой мыши по всему , чему угодно, 
будет появляться меню, а там уж все поймете<br>
</p>
  
</div>